Catalogs/ПрограммыРасчетаЗайма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ПрограммыРасчетаЗайма</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьСтавкуШтрафа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяПрограмма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбщегоМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_ДеньПросрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекращатьНачисления_ПослеПлановогоПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадатьПорядокГашения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПроценты_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСрокаЗайма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьСрокаЗайма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПериодичностей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПогашенияЗаймов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазнесенияПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРазнесенияПлатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаШтрафаПокаНачисляютсяПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСтавкиШтрафаПокаНачисляютсяПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаШтрафаПослеНачисленияПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСтавкиШтрафаПослеНачисленияПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаШтрафаНаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьСтавкиШтрафаНаПроценты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаНачисленияПроцентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазаНачисленияПроцентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритерийНаличияПросрочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КритерийНаличияПросрочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автопролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАвтопролонгаций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяПрограмма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокГашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гашение</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РасчетныеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнтервалыПроцентнойСтавки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнтервалОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыПроцентнойСтавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыПроцентнойСтавки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяПроцентнаяСтавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлавающаяПроцентнаяСтавкаЗависимаяОтСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлавающаяПроцентнаяСтавкаЗависимаяОтСрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПрограммыРасчетаЗайма/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой();
	Если Объект.Ссылка.Пустая() Или Объект.ПорядокГашения.Количество() = 0 Тогда
		Объект.ВидПроцентнойСтавки = Перечисления.ВидыПроцентнойСтавки.ФиксированнаяПроцентнаяСтавка;
		стр = Объект.ПорядокГашения.Добавить();
		стр.Гашение = ПланыВидовХарактеристик.РасчетныеХарактеристики.ПросроченныеПроценты;
		стр = Объект.ПорядокГашения.Добавить();
		стр.Гашение = ПланыВидовХарактеристик.РасчетныеХарактеристики.Проценты;
		стр = Объект.ПорядокГашения.Добавить();
		стр.Гашение = ПланыВидовХарактеристик.РасчетныеХарактеристики.ОсновнойДолг;	
		стр = Объект.ПорядокГашения.Добавить();
		стр.Гашение = ПланыВидовХарактеристик.РасчетныеХарактеристики.Пени;
		стр = Объект.ПорядокГашения.Добавить();
		стр.Гашение = ПланыВидовХарактеристик.РасчетныеХарактеристики.Штрафы;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	Элементы.ПрекращатьНачисления_Количество.Видимость				= Объект.ПрекращатьНачисления;
	Элементы.ПрекращатьНачисления_Период.Видимость					= Объект.ПрекращатьНачисления;
	Элементы.ПрекращатьНачисления_ПослеДатыВыдачиЗайма.Видимость   	= Объект.ПрекращатьНачисления;
	Элементы.ПрекращатьНачисления_ДеньПросрочки.Видимость			= Объект.ПрекращатьНачисления;
	Элементы.ПрекращатьНачисления_НаДеньПросрочки.Видимость			= Объект.ПрекращатьНачисления;
	
	Элементы.НачислятьПроценты_Количество.Видимость					= Объект.НачислятьПроценты;
	Элементы.НачислятьПроценты_ОтВыдачиЗайма.Видимость				= Объект.НачислятьПроценты;
	
	Элементы.ПорядокГашения.Видимость 								= Объект.ЗадатьПорядокГашения;
	
	Элементы.ИмяОбщегоМодуля.Видимость 								= Объект.ПользовательскаяПрограмма;
КонецПроцедуры

&НаКлиенте
Процедура ПрекращатьНачисленияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскаяПрограммаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьПорядокГашенияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура НачислятьПроцентыПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПотребительскийКредитДоОдногоГодаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьСрокаЗаймаПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияПроцентныхСтавок(ДосрочноеРасторжение)
	
	Если ДосрочноеРасторжение = Неопределено Тогда
		ПоместитьТаблицуВоВременноеХранилище("ИнтервалыПроцентнойСтавкиПослеДатыОкончания");
	ИначеЕсли ДосрочноеРасторжение Тогда
		ПоместитьТаблицуВоВременноеХранилище("ИнтервалыПроцентнойСтавкиПриДосрочномРасторжении");
	Иначе
		ПоместитьТаблицуВоВременноеХранилище("ИнтервалыПроцентнойСтавки");
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВременногоХранилища",						АдресВременногоХранилища);
	
	Если ДосрочноеРасторжение = Неопределено Тогда
		ПараметрыФормы.Вставить("ПроцентнаяСтавкаПериодичность"					,Объект.ПроцентнаяСтавкаПослеДатыОкончанияПериодичность);
		ПараметрыФормы.Вставить("ПроцентнаяСтавкаПериодичностьИнтервалов" 		,Объект.ПроцентнаяСтавкаПослеДатыОкончанияПериодичностьИнтервалов);
	ИначеЕсли ДосрочноеРасторжение Тогда
		ПараметрыФормы.Вставить("ПроцентнаяСтавкаПериодичность"					,Объект.ПроцентнаяСтавкаПериодичностьПриДосрочномЗакрытии);
		ПараметрыФормы.Вставить("ПроцентнаяСтавкаПериодичностьИнтервалов" 		,Объект.ПроцентнаяСтавкаПериодичностьИнтерваловПриДосрочномЗакрытии);
	Иначе
		ПараметрыФормы.Вставить("ПроцентнаяСтавкаПериодичность"					,Объект.ПериодичностьПроцентнойСтавки);
		ПараметрыФормы.Вставить("ПроцентнаяСтавкаПериодичностьИнтервалов" 		,Объект.ПериодичностьСрокаЗайма);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	
	ДополнительныеПараметры = Новый Структура("ДосрочноеРасторжение", ДосрочноеРасторжение);
	
	ОткрытьФорму("Справочник.ПрограммыРасчетаЗайма.Форма.ФормаРедактированияИнтервалов"
	,ПараметрыФормы
	,ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ОбработкаПослеЗакрытияФормыредактированияПроцентныхСтавок", ЭтотОбъект, ДополнительныеПараметры),
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуВоВременноеХранилище(ИмяТаблицы)
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Объект[ИмяТаблицы].Выгрузить(), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИнтервалыПроцентнойСтавкиНажатие(Элемент)
	
	ОткрытьФормуРедактированияПроцентныхСтавок(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПослеЗакрытияФормыредактированияПроцентныхСтавок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Результат.ЕстьИзменияВДанных Тогда 
		
		Модифицированность = Истина;
		
		ДосрочноеРасторжение = ДополнительныеПараметры.ДосрочноеРасторжение;
		
		Если ДосрочноеРасторжение = Неопределено Тогда
			Объект.ПроцентнаяСтавкаПослеДатыОкончанияПериодичность 				= Результат.ПроцентнаяСтавкаПериодичность;
			Объект.ПроцентнаяСтавкаПослеДатыОкончанияПериодичностьИнтервалов 	= Результат.ПроцентнаяСтавкаПериодичностьИнтервалов;
		ИначеЕсли ДосрочноеРасторжение Тогда
			Объект.ПроцентнаяСтавкаПериодичностьПриДосрочномЗакрытии 			= Результат.ПроцентнаяСтавкаПериодичность;
			Объект.ПроцентнаяСтавкаПериодичностьИнтерваловПриДосрочномЗакрытии 	= Результат.ПроцентнаяСтавкаПериодичностьИнтервалов;
		Иначе
			Объект.ПериодичностьПроцентнойСтавки 								= Результат.ПроцентнаяСтавкаПериодичность;
			Объект.ПериодичностьСрокаЗайма				 						= Результат.ПроцентнаяСтавкаПериодичностьИнтервалов;
		КонецЕсли;
		
		ОбновитьРеквизиты(ДосрочноеРасторжение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизиты(ДосрочноеРасторжение)
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	Если ТаблицаДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДосрочноеРасторжение = Неопределено Тогда
		Объект.ИнтервалыПроцентнойСтавкиПослеДатыОкончания.Загрузить(ТаблицаДанных);
	ИначеЕсли ДосрочноеРасторжение Тогда 
		Объект.ИнтервалыПроцентнойСтавкиПриДосрочномРасторжении.Загрузить(ТаблицаДанных);
	Иначе 
		Объект.ИнтервалыПроцентнойСтавки.Загрузить(ТаблицаДанных);
	КонецЕсли;
	
	РасчетЗадолженностиМФО.СформироватьТекстГиперссылкиИнтервалыПроцентнойСтавки(ЭтотОбъект, ДосрочноеРасторжение);
	
КонецПроцедуры
